In [1]:
import numpy as np
import pandas as pd
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split
from sklearn.ensemble import GradientBoostingClassifier

In [2]:
data = pd.read_csv('/Users/composerinmaking/Kaggle/titanic/train.csv')
testt=pd.read_csv('/Users/composerinmaking/Kaggle/titanic/test.csv')

In [3]:
data.shape

(891, 12)

In [4]:
#.isna() returns boolean datafram, true=missing elem
data.isna()
#sum adds accross all columns//number of missing values 
data.isna().sum()
#counts the unique values in a column
#data.value_counts(['Cabin'])

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
data['Sex'] = data['Sex'].replace(['female'], 1)
data['Sex'] = data['Sex'].replace(['male'], 0)
data['Embarked'] = data['Embarked'].replace(['S'], 0)
data['Embarked'] = data['Embarked'].replace(['Q'], 1)
data['Embarked'] = data['Embarked'].replace(['C'], 2)
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,0.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,2.0
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,0.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,0.0
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,0.0

In [111]:
data1 = data.drop(['Cabin'], axis=1)
data1 = data1.dropna()
data1.shape

(712, 11)

In [7]:
y =data1['Survived']
X = data1.drop(['PassengerId','Survived','Name', 'Ticket'], axis=1)
X.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       3    0  22.0      1      0   7.2500       0.0
1       1    1  38.0      1      0  71.2833       2.0
2       3    1  26.0      0      0   7.9250       0.0
3       1    1  35.0      1      0  53.1000       0.0
4       3    0  35.0      0      0   8.0500       0.0

In [9]:
X_train, X_test, y_train, y_test = train_test_split(X,y, random_state=42)
forest = RandomForestClassifier(n_estimators = 70, max_features=3,  max_depth=5, random_state=42)
forest.fit(X_train, y_train)

RandomForestClassifier(max_depth=5, max_features=3, n_estimators=70,
                       random_state=42)

In [10]:
print(forest.score(X_train, y_train))
forest.score(X_test, y_test)

0.8913857677902621

0.8370786516853933

GradientBoostingClassifier(n_estimators=60, random_state=0)

0.9119850187265918

0.8146067415730337

(418, 11)

(87, 11)